-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: Jun 24, 2016 at 02:52 PM
-- Server version: 10.1.13-MariaDB
-- PHP Version: 5.6.20

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `radius6`
--

-- --------------------------------------------------------

--
-- Table structure for table `sko_program`
--

CREATE TABLE `sko_program` (
  `id` int(4) NOT NULL,
  `PRO_ID` varchar(9) COLLATE utf8_unicode_ci NOT NULL,
  `PRO_NAME` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  `FAC_ID` varchar(5) COLLATE utf8_unicode_ci NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `sko_program`
--

INSERT INTO `sko_program` (`id`, `PRO_ID`, `PRO_NAME`, `FAC_ID`) VALUES
(1, 'T001', 'การท่องเที่ยว', 'de01'),
(2, 'T002', 'การโรงแรม', 'de01'),
(3, 'T003', 'ภาษาอังกฤษเพื่อการสื่อสารสากล', 'de01'),
(4, 'T004', 'อาหารและโภชนาการ', 'de01'),
(5, 'T005', 'ธุรกิจคหกรรมศาสตร์', 'de01'),
(6, 'T031', 'วิศวกรรมโทรคมนาคม', 'de04'),
(7, 'T006', 'การจัดการ-การจัดการทั่วไป', 'de05'),
(8, 'T007', 'การจัดการ-การจัดการสำนักงาน', 'de05'),
(9, 'T008', 'การจัดการ-การจัดการอุตสาหกรรม', 'de05'),
(10, 'T009', 'การตลาด', 'de05'),
(11, 'T010', 'การบัญชี', 'de05'),
(12, 'T011', 'ระบบสารสนเทศทางธุรกิจ', 'de05'),
(13, 'PT01', 'การจัดการธุรกิจขนาดกลางและขนาดย่อม', 'de05'),
(14, 'T012', 'วิศวกรรมโยธา', 'de04'),
(15, 'T013', 'วิศวกรรมไฟฟ้า', 'de04'),
(16, 'T014', 'วิศวกรรมคอมพิวเตอร์', 'de04'),
(18, 'T016', 'วิศวกรรมสำรวจ', 'de04'),
(19, 'T017', 'วิศวกรรมเครื่องกล', 'de04'),
(20, 'T018', 'วิศวกรรมอุตสาหการ', 'de04'),
(21, 'T019', 'วิศวกรรมเครื่องนุ่งห่ม', 'de04'),
(22, 'T020', 'เทคโนโลยีคอมพิวเตอร์', 'de04'),
(23, 'T021', 'เทคโนโลยีโทรคมนาคม', 'de04'),
(24, 'T022', 'เทคโนโลยีเครื่องกล', 'de04'),
(25, 'T023', 'เทคโนโลยีอุตสาหการ', 'de04'),
(26, 'P103', 'เทคโนโลยีเสื้อผ้า', 'de04'),
(27, 'T000', 'ศึกษาทั่วไป', 'de01'),
(28, 'T024', 'จิตรกรรม', 'de10'),
(29, 'T025', 'การออกแบบแฟชั่นและสิ่งทอ', 'de10'),
(30, 'T026', 'การผังเมือง', 'de10'),
(31, 'T027', 'สถาปัตยกรรม', 'de10'),
(32, 'P105', 'เทคโนโลยีสถาปัตยกรรม', 'de10'),
(33, 'T028', 'ค.อ.บ.วิศวกรรมอุตสาหการ', 'de14'),
(34, 'T029', 'ค.อ.บ.วิศวกรรมอิเล็กทรอนิกส์และโทรคมนาคม', 'de14'),
(35, 'T030', 'ค.อ.บ.วิศวกรรมแมคคาทรอนิกส์', 'de14'),
(36, 'T032', 'เทคโนโลยีสื่อสารมวลชน', 'de14'),
(37, 'T050', 'ช่างอุตสาหกรรม', 'de30'),
(38, 'T051', 'วิศวกรรมการผลิต', 'de04'),
(99, 'T015', 'วิศวกรรมอิเล็กทรอนิกส์', 'de04'),
(46, 'T59', 'งานบริหารและวางแผน', 'de03'),
(47, 'de13T001', 'เทคโนโลยีเครื่องจักรกลเกษตร', 'de13'),
(48, 'de12T001', 'สัตวแพทยศาสตรบัณฑิต', 'de12'),
(49, 'de08T001', 'การโรงแรมและการท่องเที่ยว', 'de08'),
(50, 'de07T001', 'วิทยาศาสตร์และเทคโนโลยีการอาหาร', 'de07'),
(51, 'de07T002', 'เทคโนโลยีชีวภาพ', 'de07'),
(52, 'de06T001', 'การจัดการประมง', 'de06'),
(53, 'de06T002', 'เพาะเลี้ยงสัตว์น้ำ', 'de06'),
(54, 'de06T003', 'วิทยาศาสตร์ทางทะเล', 'de06'),
(55, 'de06T004', 'อุตสาหกรรมประมง-เทคโนโลยีผลิตภัณฑ์ประมง', 'de06'),
(56, 'de06T005', 'การจัดการสิ่งแวดล้อมท้องถิ่น', 'de06'),
(57, 'de06T006', 'วิทยาศาสตร์สิ่งแวดล้อม', 'de06'),
(58, 'de06T007', 'เทคโนโลยีคอมพิวเตอร์.', 'de06'),
(59, 'de06T008', 'เทคโนโลยีอุตสาหกรรม', 'de06'),
(60, 'de03T001', 'พืชศาสตร์', 'de03'),
(61, 'de03T002', 'สัตวศาสตร์(ป.ตรี)', 'de03'),
(62, 'de03T003', 'สัตวศาสตร์(ป.โท)', 'de03'),
(63, 'de03T004', 'ประมง', 'de03'),
(64, 'de03T005', 'เทคโนโลยีภูมิทัศน์', 'de03'),
(65, 'de03T006', 'เกษตรกลวิธาน', 'de03'),
(66, 'de03T007', 'พัฒนาการเกษตรและการจัดการธุรกิจเกษตร', 'de03'),
(67, 'de03T008', 'เทคโนโลยีการผลิตพืช', 'de03'),
(68, 'de02T001', 'เคมีอุตสาหกรรม', 'de02'),
(69, 'de02T002', 'ชีววิทยาประยุกต์', 'de02'),
(70, 'de02T003', 'เทคโนโลยีการยาง', 'de02'),
(71, 'de02T004', 'เทคโนโลยีสารสนเทศ', 'de02'),
(72, 'de02T005', 'การแพทย์แผนไทยบัณฑิต', 'de02'),
(73, 'de02T006', 'เทคโนโลยีน้ำมันปาล์มและโอลิโอเคมี', 'de02'),
(77, 'de13P001', 'การบัญชี(ปวส)', 'de13'),
(78, 'de13P002', 'การตลาด(ปวส)', 'de13'),
(79, 'de13P003', 'คอมพิวเตอร์ธุรกิจ(ปวส)', 'de13'),
(80, 'de13P004', 'การจัดการ(ปวส)', 'de13'),
(81, 'de13P005', 'ช่างกลเกษตร(ปวส)', 'de13'),
(82, 'de13P006', 'เทคนิคคอมพิวเตอร์(ปวส)', 'de13'),
(83, 'de13P007', 'ช่างไฟฟ้ากำลัง(ปวส)', 'de13'),
(84, 'de13P008', 'ช่างยนต์(ปวส)', 'de13'),
(85, 'de07T003', 'การจัดการอุตสาหกรรมอาหารและบริการ', 'de07'),
(86, 'de06T009', 'อุตสาหกรรมอาหาร', 'de06'),
(87, 'de02T007', 'เทคโนโลยีอุตสาหกรรม-เทคโนโลยีโทรคมนาคม', 'de02'),
(88, 'de02T008', 'เทคโนโลยีอุตสาหกรรม-เทคโนโลยีไฟฟ้า', 'de02'),
(89, 'de02T009', 'เทคโนโลยีอุตสาหกรรม-เทคโนโลยีโยธา', 'de02'),
(90, 'de06T010', 'วิทยาศาสตร์สิ่งแวดล้อม-เทคโนโลยีสิ่งแวดล้อม', 'de06'),
(91, 'de06T011', 'การประมงและธุรกิจสัตว์น้ำ', 'de06'),
(92, 'de11T001', 'การเงิน', 'de11'),
(93, 'de11T002', 'ธุรกิจอิเล็กทรอนิกส์', 'de11'),
(94, 'de11T003', 'การจัดการโลจิสติกส์', 'de11'),
(95, 'de06T012', 'การจัดการชายฝั่งแบบบูรณาการ', 'de06'),
(96, 'de06T013', 'เทคโนโลยีเพาะเลี้ยงสัตว์น้ำ', 'de06'),
(97, 'de05T027', 'การจัดการ-การจัดการทรัพยากรมนุษย์', 'de05'),
(98, 'de05T028', 'การเงิน.', 'de05'),
(100, 'de14T030', 'เทคโนโลยีปิโตรเลียม', 'de14');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `sko_program`
--
ALTER TABLE `sko_program`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `sko_program`
--
ALTER TABLE `sko_program`
  MODIFY `id` int(4) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=101;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
